In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A': [1,2,np.nan],'B': [5, np.nan, np.nan],'C': [1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [10]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Matt', 'Ben', 'Amy', 'Vanessa', 'Sarah'],
       'Sales':[200,150,600,300,100,450]}

In [12]:
df = pd.DataFrame(data)

In [13]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG     Matt    150
2    MSFT      Ben    600
3    MSFT      Amy    300
4      FB  Vanessa    100
5      FB    Sarah    450

In [15]:
byCompany = df.groupby('Company')

In [16]:
byCompany.mean()

         Sales
Company
FB       275.0
GOOG     175.0
MSFT     450.0

In [18]:
byCompany.sum().loc['FB']

Sales    550
Name: FB, dtype: int64

In [20]:
df.groupby('Company').sum().loc['GOOG']

Sales    350
Name: GOOG, dtype: int64

In [21]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [22]:
df.groupby('Company').max()

          Person  Sales
Company
FB       Vanessa    450
GOOG         Sam    200
MSFT         Ben    600

In [23]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  275.0  247.487373  100.0  187.5  275.0  362.5  450.0
GOOG      2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0
MSFT      2.0  450.0  212.132034  300.0  375.0  450.0  525.0  600.0

In [24]:
df['Company'].unique()

array(['GOOG', 'MSFT', 'FB'], dtype=object)

In [25]:
df['Company'].nunique()

3

In [26]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [27]:
def times2(x):
    return x*2

In [28]:
df['Sales'].apply(times2)

0     400
1     300
2    1200
3     600
4     200
5     900
Name: Sales, dtype: int64

In [29]:
df['Person'].apply(len)

0    3
1    4
2    3
3    3
4    7
5    5
Name: Person, dtype: int64

In [30]:
df['Sales'].apply(lambda x: x*5)

0    1000
1     750
2    3000
3    1500
4     500
5    2250
Name: Sales, dtype: int64

In [31]:
df.sort_values('Sales')

  Company   Person  Sales
4      FB  Vanessa    100
1    GOOG     Matt    150
0    GOOG      Sam    200
3    MSFT      Amy    300
5      FB    Sarah    450
2    MSFT      Ben    600

In [32]:
df.isnull()

   Company  Person  Sales
0    False   False  False
1    False   False  False
2    False   False  False
3    False   False  False
4    False   False  False
5    False   False  False

In [36]:
df.pivot_table(values='Sales',index=['Person'], columns=['Company'])

Company     FB   GOOG   MSFT
Person
Amy        NaN    NaN  300.0
Ben        NaN    NaN  600.0
Matt       NaN  150.0    NaN
Sam        NaN  200.0    NaN
Sarah    450.0    NaN    NaN
Vanessa  100.0    NaN    NaN